index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-18 Tue 16:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>佛系少年</title>

<meta name="generator" content="Org mode" />
<meta name="author" content="qxg" />
<link rel="shortcut icon" type="image/x-icon" href="/static/img/favicon.ico">
<link rel="stylesheet" type="text/css" href="/static/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/static/css/readtheorg.css"/><link rel="stylesheet" type="text/css" href="/static/css/orgstyle.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/index.html"> UP </a>
 |
 <a accesskey="H" href="/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">佛系少年</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb2958fa">工作心得</a></li>
<li><a href="#org73e80f5">前端</a></li>
<li><a href="#org078815e">底层架构</a></li>
<li><a href="#org06471d2">编程工具</a></li>
<li><a href="#org90964b5">other</a></li>
<li><a href="#orgb9ac3c3">go</a></li>
<li><a href="#org4b6c5c8">规划</a></li>
<li><a href="#orgfec0132">linux</a></li>
<li><a href="#orgfde1708">git</a></li>
<li><a href="#org0401a29">rust</a></li>
<li><a href="#orgbafb465">study</a></li>
<li><a href="#org351fdf7">人生杂谈</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb2958fa" class="outline-2">
<h2 id="orgb2958fa">工作心得</h2>
<div class="outline-text-2" id="text-orgb2958fa">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-28 Thu] </span></span> <a href="工作心得/编程.html">关于编程</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-04-16 Tue] </span></span> <a href="工作心得/沟通.html">沟通心得</a></li>
</ul>
</div>
</div>
<div id="outline-container-org73e80f5" class="outline-2">
<h2 id="org73e80f5">前端</h2>
<div class="outline-text-2" id="text-org73e80f5">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-12 Wed] </span></span> <a href="前端/js.html">js常见问题</a></li>
</ul>
</div>
</div>
<div id="outline-container-org078815e" class="outline-2">
<h2 id="org078815e">底层架构</h2>
<div class="outline-text-2" id="text-org078815e">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-12-04 Wed] </span></span> <a href="底层架构/关于协程.html">关于协程</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-12 Fri] </span></span> <a href="底层架构/内存屏障.html">内存屏障</a></li>
</ul>
</div>
</div>
<div id="outline-container-org06471d2" class="outline-2">
<h2 id="org06471d2">编程工具</h2>
<div class="outline-text-2" id="text-org06471d2">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-16 Fri] </span></span> <a href="编程工具/regex.html">正则</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-04 Tue] </span></span> <a href="编程工具/vscode.html">vscode使用手册</a></li>
</ul>
</div>
</div>
<div id="outline-container-org90964b5" class="outline-2">
<h2 id="org90964b5">other</h2>
<div class="outline-text-2" id="text-org90964b5">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-15 Tue] </span></span> <a href="other/mac软件.html">mac软件汇总</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-15 Mon] </span></span> <a href="other/搜索技巧.html">搜索技巧</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb9ac3c3" class="outline-2">
<h2 id="orgb9ac3c3">go</h2>
<div class="outline-text-2" id="text-orgb9ac3c3">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-12-27 Fri] </span></span> <a href="go/http.html">http请求</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-12-27 Fri] </span></span> <a href="go/记一次golang死锁.html">记一次golang死锁</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-14 Wed] </span></span> <a href="go/连接超时.html">go服务持续出现连接超时问题排查</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-14 Wed] </span></span> <a href="go/gotrace.html">go trace/pprof</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-09 Fri] </span></span> <a href="go/reflect.html">go反射相关</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-23 Tue] </span></span> <a href="go/连接mysql.html">连接mysql</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-23 Tue] </span></span> <a href="go/read.html">go读写数据</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-03 Wed] </span></span> <a href="go/channel.html">go channel相关</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-02 Tue] </span></span> <a href="go/go源码剖析笔记.html">go源码剖析笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-25 Tue] </span></span> <a href="go/go高阶规划.html">go高阶规划</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-20 Thu] </span></span> <a href="go/url.html">url解析</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-18 Tue] </span></span> <a href="go/复杂json转struct.html">struct嵌套解json</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-17 Mon] </span></span> <a href="go/flag.html">flag使用方法</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-04-24 Wed] </span></span> <a href="go/time包.html">time包相关方法</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4b6c5c8" class="outline-2">
<h2 id="org4b6c5c8">规划</h2>
<div class="outline-text-2" id="text-org4b6c5c8">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-01-16 Thu] </span></span> <a href="规划/2019年总结.html">2019年工作生活总结</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-28 Thu] </span></span> <a href="规划/rust项目.html">rust项目</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-15 Tue] </span></span> <a href="规划/产品.html">理想中的产品</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-23 Mon] </span></span> <a href="规划/遗愿目标.html">遗愿目标</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-05 Wed] </span></span> <a href="规划/总职业规划.html">职业规划</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-04-16 Tue] </span></span> <a href="规划/2019年度规划.html">2019年度规划</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfec0132" class="outline-2">
<h2 id="orgfec0132">linux</h2>
<div class="outline-text-2" id="text-orgfec0132">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-01-02 Thu] </span></span> <a href="linux/unicode和utf-8的区别.html">unicode和utf-8的区别</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-12-10 Tue] </span></span> <a href="linux/同步、异步、阻塞、非阻塞.html">同步、异步、阻塞、非阻塞</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-22 Tue] </span></span> <a href="linux/shell暂停.html">shell如何暂停以及恢复</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-18 Fri] </span></span> <a href="linux/trap.html">shell中使用trap来捕获信号</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-09 Wed] </span></span> <a href="linux/pssh.html">pssh使用</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-29 Sun] </span></span> <a href="linux/cloud.html">云相关名词解释</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-27 Fri] </span></span> <a href="linux/crontab.html">crontab使用</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-25 Wed] </span></span> <a href="linux/unix读书笔记.html">unix读书笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-20 Fri] </span></span> <a href="linux/comm.html">comm命令，求交集</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-05 Thu] </span></span> <a href="linux/Linux手册.html">Linux手册</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-04 Wed] </span></span> <a href="linux/expect.html">expect自动化工具</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-02 Mon] </span></span> <a href="linux/elisp.html">emacs lisp</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-02 Mon] </span></span> <a href="linux/docker.html">docker使用</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-14 Wed] </span></span> <a href="linux/strace.html">strace</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-12 Mon] </span></span> <a href="linux/lsof.html">lsof</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-08 Thu] </span></span> <a href="linux/netcat.html">netcat手册</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-24 Wed] </span></span> <a href="linux/vim简版.html">vim简版</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-22 Mon] </span></span> <a href="linux/jq.html">json格式化工具jq</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-03 Wed] </span></span> <a href="linux/mysql索引优化.html">mysql索引优化</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-03 Wed] </span></span> <a href="linux/linux内核完全剖析学习.html">linux 内核完全剖析学习笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-27 Thu] </span></span> <a href="linux/nginx.html">nginx手册</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-25 Tue] </span></span> <a href="linux/gdb.html">gdb笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-05-28 Tue] </span></span> <a href="linux/mysql乱码.html">mysql中文显示??解决方案</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-05-27 Mon] </span></span> <a href="linux/tmux.html">tmux使用</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-05-15 Wed] </span></span> <a href="linux/core_dump.html">core dump相关</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-05-04 Sat] </span></span> <a href="linux/shell并发.html">shell 并发</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfde1708" class="outline-2">
<h2 id="orgfde1708">git</h2>
<div class="outline-text-2" id="text-orgfde1708">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-18 Tue] </span></span> <a href="git/gitFAQ.html">git常见问题</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-04-17 Wed] </span></span> <a href="git/git-push到多个仓库.html">git-push到多个仓库</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0401a29" class="outline-2">
<h2 id="org0401a29">rust</h2>
<div class="outline-text-2" id="text-org0401a29">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-18 Tue] </span></span> <a href="rust/问号运算符.html">?的运用</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-18 Tue] </span></span> <a href="rust/iter.html">iter相关</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-18 Tue] </span></span> <a href="rust/智能指针.html">智能指针</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-17 Mon] </span></span> <a href="rust/宏.html">宏</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-17 Mon] </span></span> <a href="rust/Fn、FnOnce、FnMut的区别和联系.html">Fn、FnMut、FnOnce的区别和联系</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-17 Mon] </span></span> <a href="rust/sized.html">sized与?sized</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-17 Mon] </span></span> <a href="rust/unsafe.html">unsafe使用</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-03 Mon] </span></span> <a href="rust/奇怪的生命周期.html">奇怪的生命周期</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-01-31 Fri] </span></span> <a href="rust/孤儿.html">孤儿</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-01-10 Fri] </span></span> <a href="rust/mod.html">mod查找规则</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-12-05 Thu] </span></span> <a href="rust/网页设计.html">网页设计中的小问题</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-28 Thu] </span></span> <a href="rust/rust异步.html">rust异步</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-27 Wed] </span></span> <a href="rust/string相关操作.html">string操作</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-26 Tue] </span></span> <a href="rust/继承.html">没有继承，怎么实现继承</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-26 Tue] </span></span> <a href="rust/const和static的区别.html">const和static的区别</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-15 Fri] </span></span> <a href="rust/json.html">struct json转换</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-15 Fri] </span></span> <a href="rust/reqwest.html">reqwest http库</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-15 Fri] </span></span> <a href="rust/test.html">test方法</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-15 Fri] </span></span> <a href="rust/lazy_static.html">lazy_static 全局变量</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-15 Fri] </span></span> <a href="rust/rust读写.html">rust读写数据</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-07 Thu] </span></span> <a href="rust/rust学习笔记.html">rust学习笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-31 Sat] </span></span> <a href="rust/actix-web.html">actix-web使用</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-29 Thu] </span></span> <a href="rust/cargo.html">cargo使用</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbafb465" class="outline-2">
<h2 id="orgbafb465">study</h2>
<div class="outline-text-2" id="text-orgbafb465">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-02-18 Tue] </span></span> <a href="study/看盘.html">怎么看盘</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-12-31 Tue] </span></span> <a href="study/股市.html">日本蜡烛图技术笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-24 Thu] </span></span> <a href="study/吉他笔记.html">吉他笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-10 Thu] </span></span> <a href="study/社会性动物读书笔记.html">社会性动物读书笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-10 Thu] </span></span> <a href="study/自控力.html">自控力学习笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-09 Wed] </span></span> <a href="study/word-power-made-easy.html">word power made easy学习笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-08 Tue] </span></span> <a href="study/开车心得.html">开车心得</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-11 Sun] </span></span> <a href="study/亲密关系.html">亲密关系读书笔记</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-03 Mon] </span></span> <a href="study/双拼学习.html">双拼学习</a></li>
</ul>
</div>
</div>
<div id="outline-container-org351fdf7" class="outline-2">
<h2 id="org351fdf7">人生杂谈</h2>
<div class="outline-text-2" id="text-org351fdf7">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2020-01-02 Thu] </span></span> <a href="人生杂谈/领悟.html">悟</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-11-07 Thu] </span></span> <a href="人生杂谈/台式电脑配置.html">台式电脑配置</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-16 Wed] </span></span> <a href="人生杂谈/book.html">book</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-10-08 Tue] </span></span> <a href="人生杂谈/film.html">电影/剧推荐</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-28 Sat] </span></span> <a href="人生杂谈/点子.html">点子</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-23 Mon] </span></span> <a href="人生杂谈/暴饮暴食.html">如何避免暴饮暴食</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-09-20 Fri] </span></span> <a href="人生杂谈/房.html">关于买房</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-23 Tue] </span></span> <a href="人生杂谈/blog.html">关于博客</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-07-19 Fri] </span></span> <a href="人生杂谈/孩童记忆.html">孩童时光</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-06-05 Wed] </span></span> <a href="人生杂谈/脸皮厚.html">人生在世,脸皮要厚,面子一点不值钱</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-04-18 Thu] </span></span> <a href="人生杂谈/失眠.html">失眠</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: qxg</p>
<p class="date">Created: 2020-02-18 Tue 16:54</p>
<p class="validation"></p>
</div>
</body>
</html>
